program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-tensorflow", "2.20.0"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 224, 224]> input) {
            tensor<fp32, [1, 3, 1, 1]> input__biased___y_0 = const()[name = tensor<string, []>("input__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1.ap+6]], [[-0x1.d4p+6]], [[-0x1.ecp+6]]]])];
            tensor<fp32, [1, 3, 224, 224]> input__biased__ = add(x = input, y = input__biased___y_0)[name = tensor<string, []>("input__biased__")];
            tensor<string, []> pad_0_mode_0 = const()[name = tensor<string, []>("pad_0_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_1_pad_0 = const()[name = tensor<string, []>("pad_1_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 3, 3, 3, 3])];
            tensor<string, []> input_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 224, 224]> input_to_fp16 = cast(dtype = input_to_fp16_dtype_0, x = input__biased__)[name = tensor<string, []>("cast_2")];
            tensor<fp16, [1, 3, 230, 230]> pad_1_cast_fp16 = pad(constant_val = const_0_to_fp16, mode = pad_0_mode_0, pad = pad_1_pad_0, x = input_to_fp16)[name = tensor<string, []>("pad_1_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_1_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_1_1_convolutionx_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> opennsfw2_1_conv_1_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_1_1_convolutionx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> opennsfw2_1_conv_1_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_1_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_1_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_1_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_1_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_1_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 3, 7, 7]> const_213_to_fp16 = const()[name = tensor<string, []>("const_213_to_fp16"), val = tensor<fp16, [64, 3, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [64]> const_214_to_fp16 = const()[name = tensor<string, []>("const_214_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18944)))];
            tensor<fp16, [1, 64, 112, 112]> opennsfw2_1_bn_1_1_batchnorm_add_1_cast_fp16 = conv(bias = const_214_to_fp16, dilations = opennsfw2_1_conv_1_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_1_1_convolutionx_groups_0, pad = opennsfw2_1_conv_1_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_1_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_1_1_convolutionx_strides_0, weight = const_213_to_fp16, x = pad_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_1_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 64, 112, 112]> opennsfw2_1_activation_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_1_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_1_Relu_cast_fp16")];
            tensor<int32, [2]> max_pool_0_kernel_sizes_0 = const()[name = tensor<string, []>("max_pool_0_kernel_sizes_0"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [2]> max_pool_0_strides_0 = const()[name = tensor<string, []>("max_pool_0_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<string, []> max_pool_0_pad_type_0 = const()[name = tensor<string, []>("max_pool_0_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [4]> max_pool_0_pad_0 = const()[name = tensor<string, []>("max_pool_0_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> max_pool_0_ceil_mode_0 = const()[name = tensor<string, []>("max_pool_0_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 64, 56, 56]> max_pool_0_cast_fp16 = max_pool(ceil_mode = max_pool_0_ceil_mode_0, kernel_sizes = max_pool_0_kernel_sizes_0, pad = max_pool_0_pad_0, pad_type = max_pool_0_pad_type_0, strides = max_pool_0_strides_0, x = opennsfw2_1_activation_1_Relu_cast_fp16)[name = tensor<string, []>("max_pool_0_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 64, 1, 1]> const_215_to_fp16 = const()[name = tensor<string, []>("const_215_to_fp16"), val = tensor<fp16, [32, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19136)))];
            tensor<fp16, [32]> const_216_to_fp16 = const()[name = tensor<string, []>("const_216_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23296)))];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_bn_stage0_block0_branch2a_1_batchnorm_add_1_cast_fp16 = conv(bias = const_216_to_fp16, dilations = opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block0_branch2a_1_convolutionx_strides_0, weight = const_215_to_fp16, x = max_pool_0_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block0_branch2a_1_batchnorm_add_1_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 64, 1, 1]> const_217_to_fp16 = const()[name = tensor<string, []>("const_217_to_fp16"), val = tensor<fp16, [128, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23424)))];
            tensor<fp16, [128]> const_218_to_fp16 = const()[name = tensor<string, []>("const_218_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39872)))];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_bn_stage0_block0_proj_shortcut_1_batchnorm_add_1_cast_fp16 = conv(bias = const_218_to_fp16, dilations = opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block0_proj_shortcut_1_convolutionx_strides_0, weight = const_217_to_fp16, x = max_pool_0_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block0_proj_shortcut_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_activation_stage0_block0_branch2a_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage0_block0_branch2a_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage0_block0_branch2a_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 32, 3, 3]> const_219_to_fp16 = const()[name = tensor<string, []>("const_219_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40192)))];
            tensor<fp16, [32]> const_220_to_fp16 = const()[name = tensor<string, []>("const_220_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58688)))];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_bn_stage0_block0_branch2b_1_batchnorm_add_1_cast_fp16 = conv(bias = const_220_to_fp16, dilations = opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block0_branch2b_1_convolutionx_strides_0, weight = const_219_to_fp16, x = opennsfw2_1_activation_stage0_block0_branch2a_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block0_branch2b_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_activation_stage0_block0_branch2b_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage0_block0_branch2b_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage0_block0_branch2b_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 32, 1, 1]> const_221_to_fp16 = const()[name = tensor<string, []>("const_221_to_fp16"), val = tensor<fp16, [128, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58816)))];
            tensor<fp16, [128]> const_222_to_fp16 = const()[name = tensor<string, []>("const_222_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(67072)))];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_bn_stage0_block0_branch2c_1_batchnorm_add_1_cast_fp16 = conv(bias = const_222_to_fp16, dilations = opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block0_branch2c_1_convolutionx_strides_0, weight = const_221_to_fp16, x = opennsfw2_1_activation_stage0_block0_branch2b_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block0_branch2c_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_add_1_Add_cast_fp16 = add(x = opennsfw2_1_bn_stage0_block0_branch2c_1_batchnorm_add_1_cast_fp16, y = opennsfw2_1_bn_stage0_block0_proj_shortcut_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_add_1_Add_cast_fp16")];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_activation_stage0_block0_1_Relu_cast_fp16 = relu(x = opennsfw2_1_add_1_Add_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage0_block0_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 128, 1, 1]> const_223_to_fp16 = const()[name = tensor<string, []>("const_223_to_fp16"), val = tensor<fp16, [32, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(67392)))];
            tensor<fp16, [32]> const_224_to_fp16 = const()[name = tensor<string, []>("const_224_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75648)))];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_bn_stage0_block1_branch2a_1_batchnorm_add_1_cast_fp16 = conv(bias = const_224_to_fp16, dilations = opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block1_branch2a_1_convolutionx_strides_0, weight = const_223_to_fp16, x = opennsfw2_1_activation_stage0_block0_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block1_branch2a_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_activation_stage0_block1_branch2a_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage0_block1_branch2a_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage0_block1_branch2a_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 32, 3, 3]> const_225_to_fp16 = const()[name = tensor<string, []>("const_225_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(75776)))];
            tensor<fp16, [32]> const_226_to_fp16 = const()[name = tensor<string, []>("const_226_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94272)))];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_bn_stage0_block1_branch2b_1_batchnorm_add_1_cast_fp16 = conv(bias = const_226_to_fp16, dilations = opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block1_branch2b_1_convolutionx_strides_0, weight = const_225_to_fp16, x = opennsfw2_1_activation_stage0_block1_branch2a_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block1_branch2b_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_activation_stage0_block1_branch2b_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage0_block1_branch2b_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage0_block1_branch2b_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 32, 1, 1]> const_227_to_fp16 = const()[name = tensor<string, []>("const_227_to_fp16"), val = tensor<fp16, [128, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94400)))];
            tensor<fp16, [128]> const_228_to_fp16 = const()[name = tensor<string, []>("const_228_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102656)))];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_bn_stage0_block1_branch2c_1_batchnorm_add_1_cast_fp16 = conv(bias = const_228_to_fp16, dilations = opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block1_branch2c_1_convolutionx_strides_0, weight = const_227_to_fp16, x = opennsfw2_1_activation_stage0_block1_branch2b_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block1_branch2c_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_add_1_2_Add_cast_fp16 = add(x = opennsfw2_1_bn_stage0_block1_branch2c_1_batchnorm_add_1_cast_fp16, y = opennsfw2_1_activation_stage0_block0_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_add_1_2_Add_cast_fp16")];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_activation_stage0_block1_1_Relu_cast_fp16 = relu(x = opennsfw2_1_add_1_2_Add_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage0_block1_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 128, 1, 1]> const_229_to_fp16 = const()[name = tensor<string, []>("const_229_to_fp16"), val = tensor<fp16, [32, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102976)))];
            tensor<fp16, [32]> const_230_to_fp16 = const()[name = tensor<string, []>("const_230_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(111232)))];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_bn_stage0_block2_branch2a_1_batchnorm_add_1_cast_fp16 = conv(bias = const_230_to_fp16, dilations = opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block2_branch2a_1_convolutionx_strides_0, weight = const_229_to_fp16, x = opennsfw2_1_activation_stage0_block1_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block2_branch2a_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_activation_stage0_block2_branch2a_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage0_block2_branch2a_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage0_block2_branch2a_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 32, 3, 3]> const_231_to_fp16 = const()[name = tensor<string, []>("const_231_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(111360)))];
            tensor<fp16, [32]> const_232_to_fp16 = const()[name = tensor<string, []>("const_232_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(129856)))];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_bn_stage0_block2_branch2b_1_batchnorm_add_1_cast_fp16 = conv(bias = const_232_to_fp16, dilations = opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block2_branch2b_1_convolutionx_strides_0, weight = const_231_to_fp16, x = opennsfw2_1_activation_stage0_block2_branch2a_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block2_branch2b_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 32, 56, 56]> opennsfw2_1_activation_stage0_block2_branch2b_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage0_block2_branch2b_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage0_block2_branch2b_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 32, 1, 1]> const_233_to_fp16 = const()[name = tensor<string, []>("const_233_to_fp16"), val = tensor<fp16, [128, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(129984)))];
            tensor<fp16, [128]> const_234_to_fp16 = const()[name = tensor<string, []>("const_234_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138240)))];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_bn_stage0_block2_branch2c_1_batchnorm_add_1_cast_fp16 = conv(bias = const_234_to_fp16, dilations = opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage0_block2_branch2c_1_convolutionx_strides_0, weight = const_233_to_fp16, x = opennsfw2_1_activation_stage0_block2_branch2b_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage0_block2_branch2c_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_add_2_1_Add_cast_fp16 = add(x = opennsfw2_1_bn_stage0_block2_branch2c_1_batchnorm_add_1_cast_fp16, y = opennsfw2_1_activation_stage0_block1_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_add_2_1_Add_cast_fp16")];
            tensor<fp16, [1, 128, 56, 56]> opennsfw2_1_activation_stage0_block2_1_Relu_cast_fp16 = relu(x = opennsfw2_1_add_2_1_Add_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage0_block2_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 128, 1, 1]> const_235_to_fp16 = const()[name = tensor<string, []>("const_235_to_fp16"), val = tensor<fp16, [64, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138560)))];
            tensor<fp16, [64]> const_236_to_fp16 = const()[name = tensor<string, []>("const_236_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155008)))];
            tensor<fp16, [1, 64, 28, 28]> opennsfw2_1_bn_stage1_block0_branch2a_1_batchnorm_add_1_cast_fp16 = conv(bias = const_236_to_fp16, dilations = opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage1_block0_branch2a_1_convolutionx_strides_0, weight = const_235_to_fp16, x = opennsfw2_1_activation_stage0_block2_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage1_block0_branch2a_1_batchnorm_add_1_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 128, 1, 1]> const_237_to_fp16 = const()[name = tensor<string, []>("const_237_to_fp16"), val = tensor<fp16, [256, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155200)))];
            tensor<fp16, [256]> const_238_to_fp16 = const()[name = tensor<string, []>("const_238_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(220800)))];
            tensor<fp16, [1, 256, 28, 28]> opennsfw2_1_bn_stage1_block0_proj_shortcut_1_batchnorm_add_1_cast_fp16 = conv(bias = const_238_to_fp16, dilations = opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage1_block0_proj_shortcut_1_convolutionx_strides_0, weight = const_237_to_fp16, x = opennsfw2_1_activation_stage0_block2_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage1_block0_proj_shortcut_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 64, 28, 28]> opennsfw2_1_activation_stage1_block0_branch2a_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage1_block0_branch2a_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage1_block0_branch2a_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 3, 3]> const_239_to_fp16 = const()[name = tensor<string, []>("const_239_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(221376)))];
            tensor<fp16, [64]> const_240_to_fp16 = const()[name = tensor<string, []>("const_240_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(295168)))];
            tensor<fp16, [1, 64, 28, 28]> opennsfw2_1_bn_stage1_block0_branch2b_1_batchnorm_add_1_cast_fp16 = conv(bias = const_240_to_fp16, dilations = opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage1_block0_branch2b_1_convolutionx_strides_0, weight = const_239_to_fp16, x = opennsfw2_1_activation_stage1_block0_branch2a_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage1_block0_branch2b_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 64, 28, 28]> opennsfw2_1_activation_stage1_block0_branch2b_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage1_block0_branch2b_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage1_block0_branch2b_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 64, 1, 1]> const_241_to_fp16 = const()[name = tensor<string, []>("const_241_to_fp16"), val = tensor<fp16, [256, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(295360)))];
            tensor<fp16, [256]> const_242_to_fp16 = const()[name = tensor<string, []>("const_242_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(328192)))];
            tensor<fp16, [1, 256, 28, 28]> opennsfw2_1_bn_stage1_block0_branch2c_1_batchnorm_add_1_cast_fp16 = conv(bias = const_242_to_fp16, dilations = opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage1_block0_branch2c_1_convolutionx_strides_0, weight = const_241_to_fp16, x = opennsfw2_1_activation_stage1_block0_branch2b_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage1_block0_branch2c_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 256, 28, 28]> opennsfw2_1_add_3_1_Add_cast_fp16 = add(x = opennsfw2_1_bn_stage1_block0_branch2c_1_batchnorm_add_1_cast_fp16, y = opennsfw2_1_bn_stage1_block0_proj_shortcut_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_add_3_1_Add_cast_fp16")];
            tensor<fp16, [1, 256, 28, 28]> opennsfw2_1_activation_stage1_block0_1_Relu_cast_fp16 = relu(x = opennsfw2_1_add_3_1_Add_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage1_block0_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 256, 1, 1]> const_243_to_fp16 = const()[name = tensor<string, []>("const_243_to_fp16"), val = tensor<fp16, [64, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(328768)))];
            tensor<fp16, [64]> const_244_to_fp16 = const()[name = tensor<string, []>("const_244_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(361600)))];
            tensor<fp16, [1, 64, 28, 28]> opennsfw2_1_bn_stage1_block1_branch2a_1_batchnorm_add_1_cast_fp16 = conv(bias = const_244_to_fp16, dilations = opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage1_block1_branch2a_1_convolutionx_strides_0, weight = const_243_to_fp16, x = opennsfw2_1_activation_stage1_block0_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage1_block1_branch2a_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 64, 28, 28]> opennsfw2_1_activation_stage1_block1_branch2a_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage1_block1_branch2a_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage1_block1_branch2a_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 3, 3]> const_245_to_fp16 = const()[name = tensor<string, []>("const_245_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(361792)))];
            tensor<fp16, [64]> const_246_to_fp16 = const()[name = tensor<string, []>("const_246_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(435584)))];
            tensor<fp16, [1, 64, 28, 28]> opennsfw2_1_bn_stage1_block1_branch2b_1_batchnorm_add_1_cast_fp16 = conv(bias = const_246_to_fp16, dilations = opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_dilations_0, groups = opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_groups_0, pad = opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_pad_0, pad_type = opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_pad_type_0, strides = opennsfw2_1_conv_stage1_block1_branch2b_1_convolutionx_strides_0, weight = const_245_to_fp16, x = opennsfw2_1_activation_stage1_block1_branch2a_1_Relu_cast_fp16)[name = tensor<string, []>("opennsfw2_1_bn_stage1_block1_branch2b_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 64, 28, 28]> opennsfw2_1_activation_stage1_block1_branch2b_1_Relu_cast_fp16 = relu(x = opennsfw2_1_bn_stage1_block1_branch2b_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("opennsfw2_1_activation_stage1_block1_branch2b_1_Relu_cast_fp16")];
            tensor<string, []> opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_strides_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_groups_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_pad_0 = const()[name = tensor<string, []>("opennsfw2_1_conv_stage1_block1_branch2c_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 64, 1, 1]> const_247_to_fp16 = const()[name = tensor<string, []>("const_247_to_fp16"), val = tensor<fp16, [256, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(435776)))];
            tensor<fp16, [256]> const_248_to_fp16 = const()[name = tensor<string, []>("const_248_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(468608)))];
